Configuration/Enums/бит_ум_ВариантыНаименованияДляФормОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ум_ВариантыНаименованияДляФормОтчетности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СокращенноеНаименование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолноеНаименование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/бит_ум_ОтчетностьПоИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_ОтчетностьПоИР</Name>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботу</xr:Item>
				<xr:Item>Document.Увольнение</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ум_ВыполненныеДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_ВидыСобытийПоИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполняемыеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ум_ДействияПоСобытиям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ум_РазрезыДокументовИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ум_ДополнительныеПараметрыПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ум_ДополнительныеПараметрыПечати</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначениеПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Catalogs/бит_ум_ВидыОформляемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ум_ВидыОформляемыхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Comment>(служебный)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийМакетИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийМакетХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Catalogs/НаборыДополнительныхРеквизитовИСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НаборыДополнительныхРеквизитовИСведений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМеток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/CommonModules/бит_ум_ОбновлениеИнформационнойБазы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы конфигурации Учет мигрантов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// См. описание в общем модуле ОбновлениеИнформационнойБазыБСП.ПриДобавленииПодсистемы.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "УчетМигрантов";
	Описание.Версия = бит_ум_УчетМигрантовСервер.Версия();
	
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре.
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.6";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыДокументовИР.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.7";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.8";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.9";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.11";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.ЗаполнитьСвойстваСотрудников_3_0_0_11";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.14";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановитьКонстантуРаботаВРежимеОтдельногоПриложения_3_0_0_14";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.20";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановитьКонстантуУчетПатентовНДФЛ_3_0_0_20";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.1.7";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.ОбновитьИспользованиеНаборовСвойств";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.3.5";
	Обработчик.Процедура = "Справочники.бит_ум_ОснованияДляРаботыБезРазрешения.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.1";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановкаКонстант_3_0_6_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.9.6";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановитьКонстантуВариантНаименованияОрганизацииДляФормОтчетности_3_0_9_6";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.11.4";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.ЗаполнитьКонстантуНачалоРаботы";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.0.1";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.ПереходНаУчетМигрантов";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.0.5";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.0.5";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.0.5";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_0_5";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.1.1";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_1_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.2.1";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановитьКонстантуПредупреждениеОбОплатеПатентов_3_1_2_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.3.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.3.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.3.2";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_3_2";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.1";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.1";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_4_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.8";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.8";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;            
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.5.4";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановитьКонстантуРаботаВРежимеИнтеграции_3_1_5_4";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь; 	 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.8.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.8.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.8.1";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;       
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.1";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.1";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_9_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.1";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановитьКонстантуПереноситьДанныеПаспортаИзДокументовФизЛиц_3_1_9_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина; 	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.3";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.3";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.3";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.3";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_9_3";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.5";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыДокументовИР.ЗаполнениеНаименованийДляПечати_3_1_9_5";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;    
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.1";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.1";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_10_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;		   
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.2";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.2";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.2";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.2";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_10_2";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;		
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.3";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыДокументовИР.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.4";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.4";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.4";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.4";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_10_4";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.5";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыДокументовИР.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.6";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.6";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.6";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.10.6";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_10_6";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.1";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.1";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_11_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.3";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.3";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.3";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.3";
	Обработчик.Процедура = "Документы.бит_ум_ОтчетностьПоИР.ОбновлениеДокументов_3_1_11_3";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.7";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.7";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.7";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.7";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_11_7";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.8";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.8";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.8";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.8";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_11_8";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;	 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.12.1";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.12.1";
	Обработчик.Процедура = "ПланыВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.12.1";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.12.1";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_12_1";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.12.2";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.УстановитьИспользованиеРазрезаПатента_3_1_12_2";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.13.0";
	Обработчик.Процедура = "Справочники.бит_ум_ВидыОформляемыхДокументов.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.13.0";
	Обработчик.Процедура = "РегистрыСведений.бит_ум_НазначениеДополнительныхПараметровПечати.НачальноеЗаполнение";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.13.0";
	Обработчик.Процедура = "Справочники.бит_ум_ДействияПоСобытиям.ОбновлениеДействийПоСобытиям_3_1_13_0";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.13.0";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.ОбновитьВариантыОтчетов";
	Обработчик.Опциональный = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;

КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	Если НЕ бит_ум_УчетМигрантовПовтИсп.ЭтоУМ() Тогда
		Если ОбновлениеИнформационнойБазы.ВерсияИБ("УчетМигрантов") = "0.0.0.0" И
			ОбновлениеИнформационнойБазы.ВерсияИБ("УчетИностранныхРаботников") <> "0.0.0.0" Тогда
			ОбновлениеИнформационнойБазы.УстановитьВерсиюИБ("УчетМигрантов",
				ОбновлениеИнформационнойБазы.ВерсияИБ("УчетИностранныхРаботников"), Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт

	// Ловит частично сломанное встраивание: подсистема подключена, но часть вызовов
	// в переопределяемых модулях целевой конфигурации потеряна. Полностью неподключенную
	// подсистему здесь не поймать — эта процедура тогда не вызывается вовсе, для того
	// и сделана проверка по команде в форме "О программе".
	бит_ум_ПроверкаВнедрения.ПроверитьИЗаписатьРасхождения(Истина);

КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Макет) Экспорт
	
	Если бит_ум_УчетМигрантовПовтИсп.ЭтоУМ() Тогда
		Возврат;
	КонецЕсли;
	
	Разделы = НеотображавшиесяРазделыОписанияИзменений();
	
	Если Разделы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОписаниеОбновлений(Макет, Разделы);
	
	УстановитьФлагОтображенияОписанийПоТекущуюВерсию();
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//                                           или "*", если нужно выполнять при переходе с любой конфигурации.
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы
//                                           ПредыдущееИмяКонфигурации.
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.ПредыдущееИмяКонфигурации = "УчетИностранныхРаботников";
	Обработчик.Процедура = "бит_ум_ОбновлениеИнформационнойБазы.ПереходНаУчетМигрантов";
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует
//        указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	Если ПредыдущееИмяКонфигурации = "УчетИностранныхРаботников" Тогда
		Параметры.ВыполнитьОбновлениеСВерсии = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Формирование макета описания изменений

Функция НеотображавшиесяРазделыОписанияИзменений() Экспорт
	
	Разделы = Новый СписокЗначений;
	
	МакетОписаниеОбновлений = Метаданные.ОбщиеМакеты.Найти("бит_ум_ОписаниеИзмененийСистемы");
	Если МакетОписаниеОбновлений <> Неопределено Тогда
		ПредикатВерсии = "Версия";
		ПредикатШапки = "Шапка";
		Макет = ПолучитьОбщийМакет(МакетОписаниеОбновлений);
		
		Для каждого Область Из Макет.Области Цикл
			Если СтрНайти(Область.Имя, ПредикатВерсии) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ВерсияВФорматеОписания = Сред(Область.Имя, СтрДлина(ПредикатВерсии) + 1);
			
			Если Макет.Области.Найти(ПредикатШапки + ВерсияВФорматеОписания) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РазрядыВерсииСтроками = СтрРазделить(ВерсияВФорматеОписания, "_");
			Если РазрядыВерсииСтроками.Количество() <> 4 Тогда
				Продолжить;
			КонецЕсли;
			
			ВесВерсии = ВесВерсииИзМассиваСтрок(РазрядыВерсииСтроками);
			
			Версия = ""
				+ Число(РазрядыВерсииСтроками[0]) + "."
				+ Число(РазрядыВерсииСтроками[1]) + "."
				+ Число(РазрядыВерсииСтроками[2]) + "."
				+ Число(РазрядыВерсииСтроками[3]);
				
			Разделы.Добавить(ВесВерсии, Версия);
		КонецЦикла;
		
		Разделы.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
		
	КонецЕсли;
	
	ПоследняяВерсия = ПоследняяВерсияОтображенияИзмененийСистемы();
	
	Если ПоследняяВерсия = Неопределено Тогда
		ПоследняяВерсия = ОбновлениеИнформационнойБазы.ВерсияИБ("УчетМигрантов");
		УстановитьФлагОтображенияОписанийПоТекущуюВерсию();
	КонецЕсли;
	
	Возврат ПолучитьВерсииБольшеЗаданной(Разделы, ПоследняяВерсия);
	
КонецФункции

Функция ПолучитьВерсииБольшеЗаданной(Разделы, Версия)
	
	Результат = Новый Массив;
	
	ВесВерсии = ВесВерсии(Версия);
	Для каждого ЭлементСписка Из Разделы Цикл
		Если ЭлементСписка.Значение <= ВесВерсии Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ЭлементСписка.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает числовой вес версии для сравнения версий между собой.
//
// Параметры:
//  Версия - Строка - Версия в строковом формате.
//
// Возвращаемое значение:
//  Число - вес версии
//
Функция ВесВерсии(Знач Версия) Экспорт
	
	Если Версия = "" Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ВесВерсииИзМассиваСтрок(СтрРазделить(Версия, "."));
	
КонецФункции

Функция ВесВерсииИзМассиваСтрок(РазрядыВерсииСтроками)
	
	Возврат 0
		+ Число(РазрядыВерсииСтроками[0]) * 1000000000
		+ Число(РазрядыВерсииСтроками[1]) * 1000000
		+ Число(РазрядыВерсииСтроками[2]) * 1000
		+ Число(РазрядыВерсииСтроками[3]);
	
КонецФункции

Процедура УстановитьФлагОтображенияОписанийПоТекущуюВерсию(Знач ИмяПользователя = Неопределено) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("УчетМигрантов",
		"ПоследняяВерсияОтображенияИзмененийСистемы", ОбновлениеИнформационнойБазы.ВерсияИБ("УчетМигрантов"), ,
		ИмяПользователя);
		
КонецПроцедуры
	
Функция ПоследняяВерсияОтображенияИзмененийСистемы(Знач ИмяПользователя = Неопределено) Экспорт
	
	Если ИмяПользователя = Неопределено Тогда
		ИмяПользователя = ИмяПользователя();
	КонецЕсли;
	
	ПоследняяВерсия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("УчетМигрантов",
		"ПоследняяВерсияОтображенияИзмененийСистемы", , , ИмяПользователя);
	
	Возврат ПоследняяВерсия;
	
КонецФункции

// Формирует табличный документ с описанием изменений в версиях,
// которые соответствуют переданному списку версий Разделы.
//
Функция ДокументОписаниеОбновлений(ДокументОписаниеОбновлений, Знач Разделы) Экспорт
	
	Если Разделы.Количество() = 0 Тогда
		Возврат ДокументОписаниеОбновлений;
	КонецЕсли;
	
	МакетОписаниеОбновлений = Метаданные.ОбщиеМакеты.Найти("бит_ум_ОписаниеИзмененийСистемы");
	Если МакетОписаниеОбновлений <> Неопределено Тогда
		МакетОписаниеОбновлений = ПолучитьОбщийМакет(МакетОписаниеОбновлений);
	Иначе
		Возврат Новый ТабличныйДокумент();
	КонецЕсли;
	
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Заголовок"));
	
	Для Каждого Версия Из Разделы Цикл
		
		ВывестиОписаниеИзменений(Версия, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		
	КонецЦикла;
	
	Возврат ДокументОписаниеОбновлений;
	
КонецФункции

Процедура ВывестиОписаниеИзменений(Знач НомерВерсии, ДокументОписаниеОбновлений, МакетОписаниеОбновлений)
	
	Номер = СтрЗаменить(НомерВерсии, ".", "_");
	
	Если МакетОписаниеОбновлений.Области.Найти("Шапка" + Номер) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Шапка" + Номер));
	ДокументОписаниеОбновлений.НачатьГруппуСтрок("Версия" + Номер);
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Версия" + Номер));
	ДокументОписаниеОбновлений.ЗакончитьГруппуСтрок();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Отступ"));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Заполнение пустой ИБ

Процедура ЗаполнитьСвойстваСотрудников_3_0_0_11() Экспорт
	
	СоздатьДополнительноеСведение("ДоверенностьНаРаботуСИностранцемНомер",
		НСтр("ru = 'Доверенность на работу с иностранцами №'"), 
		НСтр("ru = 'Номер доверенности для подачи отчетных форм по иностранным работникам'"),
		"Справочник_Сотрудники", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	
	СоздатьДополнительноеСведение("ДоверенностьНаРаботуСИностранцемДата",
		НСтр("ru = 'Доверенность на работу с иностранцами дата'"), 
		НСтр("ru = 'Дата доверенности для подачи отчетных форм по иностранным работникам'"),
		"Справочник_Сотрудники", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
КонецПроцедуры

Функция СоздатьДополнительноеСведение(Имя, Наименование, Описание, Знач Набор, ТипЗначения)
	
	Если Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений.Реквизиты.Найти("ИмяПредопределенногоНабора") <> Неопределено Тогда
		Набор = УправлениеСвойствами.НаборСвойствПоИмени(Набор);
	Иначе
		Набор = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.НаборыДополнительныхРеквизитовИСведений." + Набор);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Имя", Имя);
	Запрос.УстановитьПараметр("НаборСвойств", Набор);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Имя = &Имя
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		
		НаименованиеНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Набор, "Наименование");
	
		ЭлементОбъект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		ЭлементОбъект.Имя = Имя;
		ЭлементОбъект.Заголовок = Наименование;
		ЭлементОбъект.Наименование = ЭлементОбъект.Заголовок + " (" + НаименованиеНабора + ")";
		ЭлементОбъект.НаборСвойств = Набор;
		ЭлементОбъект.ТипЗначения = ТипЗначения;
		ЭлементОбъект.Подсказка = Описание;
		ЭлементОбъект.ЭтоДополнительноеСведение = Истина;
	
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭлементОбъект);
	
		ЭлементСсылка = ЭлементОбъект.Ссылка;
		
	КонецЕсли;
	
	ОбъектНаборСвойств = Набор.ПолучитьОбъект();
	ТабличнаяЧасть = ОбъектНаборСвойств.ДополнительныеСведения;
	НайденнаяСтрока = ТабличнаяЧасть.Найти(ЭлементСсылка, "Свойство");
	Если НайденнаяСтрока = Неопределено Тогда
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		НоваяСтрока.Свойство = ЭлементСсылка;
		ОбъектНаборСвойств.Записать();
	КонецЕсли;
	
	Возврат ЭлементСсылка;
	
КонецФункции

Процедура ОбновитьДополнительноеСведение(Имя, Наименование, Описание, Знач Набор, ТипЗначения)
	
	Если Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений.Реквизиты.Найти("ИмяПредопределенногоНабора") <> Неопределено Тогда
		Набор = УправлениеСвойствами.НаборСвойствПоИмени(Набор);
	Иначе
		Набор = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.НаборыДополнительныхРеквизитовИСведений." + Набор);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("НаборСвойств", Набор);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Заголовок = &Наименование
	|	И ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НаименованиеНабора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Набор, "Наименование");
	
		ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементОбъект.Имя = Имя;
		ЭлементОбъект.Заголовок = Наименование;
		ЭлементОбъект.Наименование = ЭлементОбъект.Заголовок + " (" + НаименованиеНабора + ")";
		ЭлементОбъект.НаборСвойств = Набор;
		ЭлементОбъект.ТипЗначения = ТипЗначения;
		ЭлементОбъект.Подсказка = Описание;
		ЭлементОбъект.ЭтоДополнительноеСведение = Истина;
	
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭлементОбъект);
	
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьКонстантуРаботаВРежимеОтдельногоПриложения_3_0_0_14() Экспорт
	
	Константы.бит_ум_РаботаВРежимеОтдельногоПриложения.Установить(бит_ум_УчетМигрантовПовтИсп.ЭтоУМ());
	
КонецПроцедуры

Процедура УстановитьКонстантуУчетПатентовНДФЛ_3_0_0_20() Экспорт
	
	Константы.бит_ум_УчетПатентовНДФЛ.Установить(Константы.бит_ум_УчетПатентов.Получить()
		И Метаданные.Документы.Найти("АвансовыйПлатежИностранцаПоНДФЛ") <> Неопределено);
	
КонецПроцедуры

Процедура ОбновитьИспользованиеНаборовСвойств() Экспорт
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_бит_ум_ОтчетностьПоИР", УправлениеСвойствами.СтруктураПараметровНабораСвойств());
	
КонецПроцедуры

Процедура УстановкаКонстант_3_0_6_1() Экспорт
	
	Константы.бит_ум_УбратьЗапятыеИзАдреса.Установить(Ложь);
	Константы.бит_ум_ВидАдресаМестонахожденияОрганизации.Установить(Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	
КонецПроцедуры

Процедура УстановитьКонстантуВариантНаименованияОрганизацииДляФормОтчетности_3_0_9_6() Экспорт
	
	Константы.бит_ум_ВариантНаименованияОрганизацииДляФормОтчетности.Установить(
		Перечисления.бит_ум_ВариантыНаименованияДляФормОтчетности.ПолноеНаименование);
	
КонецПроцедуры

Процедура ЗаполнитьКонстантуНачалоРаботы() Экспорт
	
	ВыполнятьНачальнуюНастройкуПрограммы = Константы.бит_ум_ВыполнятьНачальнуюНастройкуПрограммы.Получить();
	НеВыполнятьНачальнуюНастройкуПрограммы = Константы.бит_ум_НеВыполнятьНачальнуюНастройкуПрограммы.Получить();
	
	Если ВыполнятьНачальнуюНастройкуПрограммы <> НеВыполнятьНачальнуюНастройкуПрограммы Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДействияПоСобытиям.Ссылка) КАК Ссылка
	|ИЗ
	|	Справочник.бит_ум_ДействияПоСобытиям КАК ДействияПоСобытиям";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Константы.бит_ум_ВыполнятьНачальнуюНастройкуПрограммы.Установить(НЕ Выборка.Следующий() ИЛИ Выборка.Ссылка = 0);
	
КонецПроцедуры

Процедура ПереходНаУчетМигрантов() Экспорт
	
	// Исправление ошибки в названии макета
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыОформляемыхДокументов.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВидыОформляемыхДокументов.ИмяМакета = ""УведомлениеОПрибытииВМестоПребыванияСервыйФон_201912""
	|			ТОГДА ""УведомлениеОПрибытииВМестоПребыванияСерыйФон_201912""
	|		КОГДА ВидыОформляемыхДокументов.ИмяМакета = ""УведомлениеОПрибытииВМестоПребыванияСервыйФон_202006""
	|			ТОГДА ""УведомлениеОПрибытииВМестоПребыванияСерыйФон_202006""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИмяМакета
	|ИЗ
	|	Справочник.бит_ум_ВидыОформляемыхДокументов КАК ВидыОформляемыхДокументов
	|ГДЕ
	|	(ВидыОформляемыхДокументов.ИмяМакета = ""УведомлениеОПрибытииВМестоПребыванияСервыйФон_201912""
	|			ИЛИ ВидыОформляемыхДокументов.ИмяМакета = ""УведомлениеОПрибытииВМестоПребыванияСервыйФон_202006"")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ИмяМакета) Тогда
			Продолжить;
		КонецЕсли;
	
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ИмяМакета = Выборка.ИмяМакета;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		
	КонецЦикла;
	
	РежимВъездаПоУмолчанию = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("УчетИностранныхРаботников", "РежимВъездаИРВРФПоУмолчанию");
	СтатусПоУмолчанию = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("УчетИностранныхРаботников", "СтатусИРПоУмолчанию");	
	
	Если ЗначениеЗаполнено(РежимВъездаПоУмолчанию) Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("УчетМигрантов", "РежимВъездаИРВРФПоУмолчанию", РежимВъездаПоУмолчанию);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусПоУмолчанию) Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("УчетМигрантов", "СтатусИРПоУмолчанию", СтатусПоУмолчанию);
	КонецЕсли;
	
	ОбновитьДополнительноеСведение("ДоверенностьНаРаботуСИностранцемНомер",
		НСтр("ru = 'Доверенность на работу с иностранцами №'"), 
		НСтр("ru = 'Номер доверенности для подачи отчетных форм по иностранным работникам'"),
		"Справочник_Сотрудники", ОбщегоНазначения.ОписаниеТипаСтрока(15));
	
	ОбновитьДополнительноеСведение("ДоверенностьНаРаботуСИностранцемДата",
		НСтр("ru = 'Доверенность на работу с иностранцами дата'"), 
		НСтр("ru = 'Дата доверенности для подачи отчетных форм по иностранным работникам'"),
		"Справочник_Сотрудники", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
КонецПроцедуры

Процедура УстановитьКонстантуПредупреждениеОбОплатеПатентов_3_1_2_1() Экспорт
	
	Константы.бит_ум_ПредупреждениеОбОплатеПатентов.Установить(3);
	
КонецПроцедуры

// Включает использование разреза у вида документа "Патент": только у патентов работника может
// быть несколько одновременно действующих экземпляров.
//
Процедура УстановитьИспользованиеРазрезаПатента_3_1_12_2() Экспорт

	ВидПатента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.Патент");
	Если НЕ ЗначениеЗаполнено(ВидПатента)
		ИЛИ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПатента, "ИспользоватьРазрез") Тогда
		Возврат;
	КонецЕсли;

	ВидДокумента = ВидПатента.ПолучитьОбъект();
	ВидДокумента.ИспользоватьРазрез = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидДокумента);

КонецПроцедуры

Процедура УстановитьКонстантуРаботаВРежимеИнтеграции_3_1_5_4() Экспорт
	
	Константы.бит_ум_РаботаВРежимеИнтеграции.Установить(НЕ Константы.бит_ум_РаботаВРежимеОтдельногоПриложения.Получить());
	
КонецПроцедуры       

Процедура УстановитьКонстантуПереноситьДанныеПаспортаИзДокументовФизЛиц_3_1_9_1() Экспорт
	
	Константы.бит_ум_ПереноситьДанныеПаспортаИзДокументовФизЛиц.Установить(Истина);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления

// Перезаполняет варианты отчетов по составу, заданному в конфигурации.
//
// Изменения в схемах компоновки и настройках отчетов доходят до пользователя
// только после перезаполнения вариантов, поэтому оно выполняется обработчиком
// обновления, а не оставляется на усмотрение пользователя.
//
Процедура ОбновитьВариантыОтчетов() Экспорт

	ПараметрыОбновленияНастроек = ВариантыОтчетов.ПараметрыОбновленияНастроек();
	ПараметрыОбновленияНастроек.Конфигурация = Истина;

	ВариантыОтчетов.Обновить(ПараметрыОбновленияНастроек);

КонецПроцедуры

#КонецОбласти
